docs/set/test/v150/wsdl/sync/recibe.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="http://ekuatia.set.gov.py/sifen/xsd" xmlns:ns0="http://ekuatia.set.gov.py/sifen/xsd" xmlns:wsp200607="http://www.w3.org/2006/07/ws-policy" xmlns:wsp200409="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soap11="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
<wsdl:types xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<xsd:schema>
<xsd:import schemaLocation="recibe.wsdl.xsd1.xsd" namespace="http://ekuatia.set.gov.py/sifen/xsd"/></xsd:schema></wsdl:types>
<wsdl:message name="rEnviDe">
<wsdl:part name="rEnviDe" element="xsns:rEnviDe" xmlns:xsns="http://ekuatia.set.gov.py/sifen/xsd"/></wsdl:message>
<wsdl:message name="rRetEnviDe">
<wsdl:part name="rRetEnviDe" element="xsns:rRetEnviDe" xmlns:xsns="http://ekuatia.set.gov.py/sifen/xsd"/></wsdl:message>
<wsdl:portType name="de-ws-sync-recibe">
<wsdl:operation name="rEnviDe">
<wsdl:input name="rEnviDe" message="ns0:rEnviDe"/>
<wsdl:output name="rRetEnviDe" message="ns0:rRetEnviDe"/></wsdl:operation></wsdl:portType>
<wsdl:binding name="de-ws-sync-recibeSoap12" type="ns0:de-ws-sync-recibe">
<soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<wsdl:operation name="rEnviDe">
<soap12:operation soapAction="" soapActionRequired="false" style="document"/>
<wsdl:input name="rEnviDe">
<soap12:body use="literal"/></wsdl:input>
<wsdl:output name="rRetEnviDe">
<soap12:body use="literal"/></wsdl:output></wsdl:operation></wsdl:binding>
<wsdl:service name="de-ws-sync-recibeService">
<wsdl:port name="de-ws-sync-recibeSoap12" binding="ns0:de-ws-sync-recibeSoap12">
<soap12:address location="https://sifen-test.set.gov.py/de/ws/sync/recibe.wsdl"/></wsdl:port></wsdl:service></wsdl:definitions>